const data = `906-908 新叶喵 蒂蕾喵 魔幻假面喵
909-911 呆火鳄 炙烫鳄 骨纹巨声鳄
912-914 润水鸭 涌跃鸭 狂欢浪舞鸭
915-916 爱吃豚 飘香豚
917 土龙节节
918-919 团珠蛛 操陷蛛
920-921 豆蟋蟀 烈腿蝗
922-923 虫滚泥 虫甲圣
924-925 墓仔狗 墓扬犬
926-927 飘飘雏 超能艳鸵
928 奇麒麟
929-930 海地鼠 海三地鼠
931 吃吼霸
932 轻身鳕
933-934 波普海豚 海豚侠
935-937 迷你芙 奥利纽 奥利瓦
938-939 热辣娃 狠辣椒
940-941 光蝌仔 电肚蛙
942-943 噗隆隆 普隆隆姆
944 拖拖蚓
945-946 一对鼠 一家鼠
947-948 走鲸 浩大鲸
949-951 凉脊龙 冻脊龙 戟脊龙
952 米粒龙
953 摩托蜥
954-956 布拨 布土拨 巴布土拨
957-958 电海燕 大电海燕
959 下石鸟
960 怒鹦哥
961 缠红鹤
962 毛崖蟹
963-965 盐石宝 盐石垒 盐石巨灵
966-967 晶光芽 晶光花
968-969 滋汁鼹 涂标客
970-971 狗仔包 麻花犬
972-973 偶叫敖 獒教父
974-975 纳噬草 怖纳噬草
976-977 索财灵 赛富豪
978-985 古代种，依次为雄伟牙 猛恶菇 水君 沙铁皮 吼叫尾 振翼发 爬地翅 轰鸣月
986-993 未来种，依次为铁辙迹 草鹿 铁毒蛾 铁臂膀 铁脖颈 铁荆棘 铁包袱 铁武者
994-997 古鼎鹿 古剑豹 古鉴蜗 古玉鱼
998-999 故勒顿 密勒顿
1000-1002 小锻匠 巧锻匠 巨锻匠
1003-1005 碳小侍 红莲铠骑 苍炎刃鬼
1006-1007 原野水母 陆地水母
1008 仆刀将军
1009 土王
1010 弃世猴`;

const json = {};
data.split('\n').forEach((line) => {
  const arr = line.split(' ');
  const id = arr[0];
  const nums = [];
  if (id.includes('-')) {
    const idArr = id.split('-').map(Number);
    for (let i = idArr[0]; i <= idArr[1]; i++) {
      nums.push(i);
    }
  } else {
    nums[0] = Number(id);
  }
  if (nums.length >= arr.length) {
    console.log(line);
  }
  nums.forEach((num, index) => {
    json[num] = arr[index + 1] ?? 'UNKNOW';
  });
});

const fs = require('fs');
const path = require('path');
fs.writeFileSync(
  path.join(__dirname, 'code1.json'),
  JSON.stringify(json),
  'utf-8'
);
